rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
    }
    acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &acc_data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &mag_data_characteristic_size;
    mag_notify_params.offset = 0;

    //Set the notifcation_done boolean to false and start notifications.
    //The boolean will be set to true in the BLE handler when the notification
    //is complete, alerting us to send out the next notification.
    m_notification_done = false;
    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification

    while (!m_notification_done) {} //wait for the three notifications to go out before continuing
    //APP_ERROR_CHECK(ret); //Uncommenting this can help debug notification errors
}

uint64_t findGCD(uint64_t a, uint64_t b)
{
    if (b == 0) return a;
    return findGCD(b, a % b);
}

uint64_t findLCM(uint64_t a, uint64_t b)
{
    return (a * b) / findGCD(a, b);
}

float findDecimalLCM(float a, float b)
{
    return findLCM(a * 1000000, b * 1000000) / 1000000.0;
}

void calculate_samples_and_connection_interval()
{
    //This method is used to select the appropriate number of sensor samples to collect
    //and the min-max connection interval to select to minimize data loss.

    //This method is necessary as a consequence of not being able to set a specific 
    //connection interval, the interval must be negotiated between two devices and thus
    //is prone to not be exactly what we want. On iOS devices, in particular, the minimumn
    //and maximum requested connection interval must be at least 15 milliseconds apart. 
    //Depending on the current sensor ODR 15 milliseconds can be anywhere from 0.75 sensor
    //samples at an ODR of 50 Hz to 6 samples at 400 Hz. Basically, depending on what the 
    //negotiated connection interval is, it may make sense to collect more or less samples
    //at a time from the sensors in order to minimize data being overwritten.

    //Since we won't know what the actual connection interval will be until after it's
    //negotiated, we attempt to pick a min and max interval that will maximize our chances
    //of having low data loss.
    int minimum_time = ceil(1000.0 / current_sensor_odr);
    minimum_time += (15 - minimum_time % 15);

    int maximum_time = ceil(MAX_SENSOR_SAMPLES * 1000.0 / current_sensor_odr);
    maximum_time += (15 - maximum_time % 15);

    float current_expected_loss = 1.0, current_best_loss = 1.0; //at 0 samples read we expect to lose all data
    int current_time = minimum_time, best_minimum_interval = 0;

    for (; current_time <= maximum_time; current_time += 15)
    {
        //For each time interval we calcualte the expected data loss for choosing 1 - MAX_SENSOR_SAMPLES
        //number of samples. If the time needed to collect the samples is longer than the current_time
        //limit we stop iterating (we never want our data collection time to be longer than the connection
        //interval or the data will start to lag).
        float best_data_loss_percentage = 1.0; 
        for (int i = 1; i <= MAX_SENSOR_SAMPLES; i++)
        {
            float data_collection_time = i * 1000.0 / current_sensor_odr;

            //we assume that if the data collection time = the connection interval we will slowly fall behind. So 
            //only carry out the calculation when the data collection time is less than the connection interval
            if (data_collection_time >= current_time) break;

            //Calculate the expected data loss with current data_collection_time and connection interval
            float connection_cycle_length = findDecimalLCM(current_time, data_collection_time);

            float total_connection_intervals = connection_cycle_length / current_time;
            float total_data_packets = connection_cycle_length / data_collection_time;
            float data_loss_percentage = (total_data_packets - total_connection_intervals) / total_data_packets;

            if (data_loss_percentage < best_data_loss_percentage) best_data_loss_percentage = data_loss_percentage;
        }

        //We now assume that we choose the lower of the two current connection intervals
        //being compared. We expect to get the higher connection interval 90% of the time
        //and the lower interval only 10% of the time.
        float expected_data_loss = 0.1 * current_expected_loss + 0.9 * best_data_loss_percentage;
        if (expected_data_loss < current_best_loss)
        {
            current_best_loss = expected_data_loss;
            best_minimum_interval = current_time - 15;
        }

        current_expected_loss = best_data_loss_percentage;
    }
    
